t21/Walnut_X/Packages/.cache/Keil.EFM32PG1B_DFP.1.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>EFM32PG1B_DFP</name>
  <description>Silicon Labs EFM32 Pearl Gecko Series Device Support</description>

  <releases>
    <release version="1.0.0" date="2016-04-22">
      Initial Release version of EFM32PG1B Device Family Pack.
      device support files to V4.2.0.
      emlib, emdrv to V4.2.0.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFM32PG1B</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFM32PG1B Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="38400000"/>

      <book name="Documents/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
      <!--book name="Documents/EFM32PG1B-RM.pdf" title="EFM32PG1B Reference Manual"/-->
      <description>
Silicon Labs' EFM32 Pearl Gecko 32-bit microcontroller family is brand new.
      </description>

      <!-- ************************  Subfamily 'EFM32PG1B100 GM32'  **************************** -->
      <subFamily DsubFamily="EFM32PG1B100 GM32">
        <!--book name="Documents/EFM32PG1B100FXX_DataSheet.pdf" title="EFM32PG1B100 Data Sheet"/-->

<!--
        <feature type="IOs"           n="41"                     name="General Purpose I/O pins"/>
        <feature type="ExtInt"        n="16"                     name="External Interrupts"/>
        <feature type="DMA"           n="12"                     name="Central DMA Controller"/>
        <feature type="Crypto"        n="128.256"                name="Advanced Encryption Standard (AES)"/>
        <feature type="SPI"           n="2"                      name="Serial Peripheral Interface (SPI)"/>
        <feature type="UART"          n="2"                      name="UART Interface"/>
        <feature type="UART"          n="2"                      name="Low Energy UART Interface"/>
        <feature type="I2C"           n="2"                      name="I2C Interface with SMBus support"/>
        <feature type="Timer"         n="4"        m="16"        name="Timer"/>
        <feature type="Timer"         n="1"        m="16"        name="Low Energy Timer"/>
        <feature type="Timer"         n="1"        m="24"        name="Real-Time Counter"/>
        <feature type="Timer"         n="1"        m="32"        name="Real-Time Counter"/>
        <feature type="TimerOther"    n="3"                      name="8/16-bit Pulse Counter"/>
        <feature type="WDT"           n="1"                      name="Watchdog Timer with dedicated RC oscillator"/>
        <feature type="RTC"           n="32768"                  name="Real Time Counter (RTC)"/>
        <feature type="ADC"           n="8"        m="12"        name="ADC"/>
        <feature type="DAC"           n="2"        m="12"        name="DAC"/>
        <feature type="TempSens"      n="1"                      name="Temperature Sensor"/>
        <feature type="AnalogOther"   n="3"                      name="Operational Amplifier"/>
        <feature type="AnalogOther"   n="2"                      name="Analog Comparator"/>
        <feature type="AnalogOther"   n="1"                      name="Supply Voltage Comparator"/>
        <feature type="Other"         n="1"                      name="Low Energy Sensor Interface (LESENSE)"/>
        <feature type="Other"         n="1"                      name="RF Module"/>
        <feature type="VCC"           n="1.98"     m="3.8"       name="Single supply voltage"/>
        <feature type="Temp"          n="-40"      m="85"        name="Extended Operating Temperature Range"/>
        <feature type="QFN"           n="64"                     name="QFN Package"/>
-->

        <!-- *************************  Device 'EFM32PG1B100F128GM32'  ***************************** -->
        <device Dname="EFM32PG1B100F128GM32">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B100F128GM32"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B100F128GM32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>

        <!-- *************************  Device 'EFM32PG1B100F256GM32'  ***************************** -->
        <device Dname="EFM32PG1B100F256GM32">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B100F256GM32"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B100F256GM32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32PG1B200 GM32'  **************************** -->
      <subFamily DsubFamily="EFM32PG1B200 GM32">
        <!--book name="Documents/EFM32PG1B200FXX_DataSheet.pdf" title="EFM32PG1B200 Data Sheet"/-->

        <!-- *************************  Device 'EFM32PG1B200F128GM32'  ***************************** -->
        <device Dname="EFM32PG1B200F128GM32">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B200F128GM32"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B200F128GM32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>

        <!-- *************************  Device 'EFM32PG1B200F256GM32'  ***************************** -->
        <device Dname="EFM32PG1B200F256GM32">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B200F256GM32"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B200F256GM32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
      </subFamily>

