t21/Walnut_X/Packages/.cache/Keil.EFM32PG1B_DFP.1.0.0.pdsc
      <!-- ************************  Subfamily 'EFM32PG1B200 GM48'  **************************** -->
      <subFamily DsubFamily="EFM32PG1B200 GM48">
        <!--book name="Documents/EFM32PG1B200FXX_DataSheet.pdf" title="EFM32PG1B200 Data Sheet"/-->

        <!-- *************************  Device 'EFM32PG1B200F128GM48'  ***************************** -->
        <device Dname="EFM32PG1B200F128GM48">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B200F128GM48"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B200F128GM48.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>

        <!-- *************************  Device 'EFM32PG1B200F256GM48'  ***************************** -->
        <device Dname="EFM32PG1B200F256GM48">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B200F256GM48"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B200F256GM48.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFM32PG1B">
      <description>Silicon Labs EFM32PG1B devices</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32PG1B*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFM32PG1B CMSIS">
      <description>Silicon Labs EFM32PG1B devices and CMSIS-CORE</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
    <condition id="emlib EMU">
      <description>Silicon Labs emlib with EMU</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="EMU"/>
    </condition>
    <condition id="emlib CMU">
      <description>Silicon Labs emlib with CMU</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
    </condition>
    <condition id="emlib CMU SYSTEM">
      <description>Silicon Labs emlib with CMU</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
    <condition id="emlib CMU GPIO">
      <description>Silicon Labs emlib with CMU and GPIO</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
    </condition>
    <condition id="emlib CMU INT">
      <description>Silicon Labs emlib with CMU and INT</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="INT"/>
    </condition>
  </conditions>

  <taxonomy>
    <description Cclass="Device"        Cgroup="emlib"   doc="emdoc/efm32pg1/html/group__EM__Library.html">Silicon Labs EFM32 emlib Peripheral Library</description>
  </taxonomy>

  <components>
    <!-- Startup -->
    <component Cclass="Device" Cgroup="Startup" Cversion="4.2.1" condition="EFM32PG1B CMSIS">
      <description>System Startup for Silicon Labs EFM32PG device series</description>
      <files>
        <file category="doc"     name="emdoc/efm32pg1/html/index.html"/>

        <file category="include" name="Device/EFM32PG1B/Include/"/>
        <file category="source"  name="Device/EFM32PG1B/Source/ARM/startup_efm32pg1b.s" attr="config" version="4.2.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/EFM32PG1B/Source/GCC/startup_efm32pg1b.c" attr="config" version="4.2.1" condition="Compiler GCC"  />
        <file category="source"  name="Device/EFM32PG1B/Source/system_efm32pg1b.c"      attr="config" version="4.2.1"/>
        <!-- device configuration required by drivers at the moment -->
        <!--file category="header"  name="RTE_Driver/Config/RTE_Device.h" attr="config" version="2.00"/-->
      </files>
    </component>

    <!-- emlib -->
    <component Cclass="Device" Cgroup="emlib" Csub="Framework" Cversion="4.2.1" condition="EFM32PG1B">
      <description>emlib Framework</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_FRAMEWORK
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32pg1/html/group__EM__Library.html"/>
        <file category="header"  name="emlib/inc/em_common.h"/>
        <file category="header"  name="emlib/inc/em_chip.h"/>
        <file category="header"  name="emlib/inc/em_bus.h"/>
        <file category="header"  name="emlib/inc/em_bitband.h"/>
        <file category="header"  name="emlib/inc/em_version.h"/>
        <file category="header"  name="emlib/inc/em_assert.h"/>
        <file category="source"  name="emlib/src/em_assert.c"/>
      </files>
    </component>
